betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rtc_ex.c
  /* Get the Timestamp time and date registers values */
  tmptime = (uint32_t)(hrtc->Instance->TSTIME & RTC_TIME_RESERVED_MASK);
  tmpdate = (uint32_t)(hrtc->Instance->TSDATE & RTC_DATE_RESERVED_MASK);

  /* Fill the Time structure fields with the read parameters */
  sTimeStamp->Hours      = (uint8_t)((tmptime & (RTC_TSTIME_HRT  | RTC_TSTIME_HRU))  >> RTC_TSTIME_HRU_Pos);
  sTimeStamp->Minutes    = (uint8_t)((tmptime & (RTC_TSTIME_MINT | RTC_TSTIME_MINU)) >> RTC_TSTIME_MINU_Pos);
  sTimeStamp->Seconds    = (uint8_t)((tmptime & (RTC_TSTIME_SECT  | RTC_TSTIME_SECU))  >> RTC_TSTIME_SECU_Pos);
  sTimeStamp->TimeFormat = (uint8_t)((tmptime & (RTC_TSTIME_TIMEFCFG))                 >> RTC_TSTIME_TIMEFCFG_Pos);
  sTimeStamp->SubSeconds = (uint32_t) hrtc->Instance->TSSUBSEC;

  /* Fill the Date structure fields with the read parameters */
  sTimeStampDate->Year    = 0U;
  sTimeStampDate->Month   = (uint8_t)((tmpdate & (RTC_TSDATE_MONT | RTC_TSDATE_MONU)) >> RTC_TSDATE_MONU_Pos);
  sTimeStampDate->Date    = (uint8_t)((tmpdate & (RTC_TSDATE_DAYT | RTC_TSDATE_DAYU)) >> RTC_TSDATE_DAYU_Pos);
  sTimeStampDate->WeekDay = (uint8_t)((tmpdate & (RTC_TSDATE_WEEKSEL))              >> RTC_TSDATE_WEEKSEL_Pos);

  /* Check the input parameters format */
  if (Format == RTC_FORMAT_BIN)
  {
    /* Convert the Timestamp structure parameters to Binary format */
    sTimeStamp->Hours   = (uint8_t)RTC_Bcd2ToByte(sTimeStamp->Hours);
    sTimeStamp->Minutes = (uint8_t)RTC_Bcd2ToByte(sTimeStamp->Minutes);
    sTimeStamp->Seconds = (uint8_t)RTC_Bcd2ToByte(sTimeStamp->Seconds);

    /* Convert the DateTimeStamp structure parameters to Binary format */
    sTimeStampDate->Month   = (uint8_t)RTC_Bcd2ToByte(sTimeStampDate->Month);
    sTimeStampDate->Date    = (uint8_t)RTC_Bcd2ToByte(sTimeStampDate->Date);
    sTimeStampDate->WeekDay = (uint8_t)RTC_Bcd2ToByte(sTimeStampDate->WeekDay);
  }

  /* Clear the Timestamp Flag */
  __DAL_RTC_TIMESTAMP_CLEAR_FLAG(hrtc, RTC_FLAG_TSF);

  return DAL_OK;
}
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @brief  Sets Tamper.
  * @note   By calling this API the tamper global interrupt will be disabled.
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sTamper Pointer to Tamper Structure.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTCEx_SetTamper(RTC_HandleTypeDef *hrtc, RTC_TamperTypeDef *sTamper)
{
  uint32_t tmpreg = 0U;

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_TAMPER(sTamper->Tamper));
  ASSERT_PARAM(IS_RTC_TAMPER_TRIGGER(sTamper->Trigger));

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  ASSERT_PARAM(IS_RTC_TAMPER_PIN(sTamper->PinSelection));
  ASSERT_PARAM(IS_RTC_TAMPER_FILTER(sTamper->Filter));
  ASSERT_PARAM(IS_RTC_TAMPER_FILTER_CONFIG_CORRECT(sTamper->Filter, sTamper->Trigger));
  ASSERT_PARAM(IS_RTC_TAMPER_SAMPLING_FREQ(sTamper->SamplingFrequency));
  ASSERT_PARAM(IS_RTC_TAMPER_PRECHARGE_DURATION(sTamper->PrechargeDuration));
  ASSERT_PARAM(IS_RTC_TAMPER_PULLUP_STATE(sTamper->TamperPullUp));
  ASSERT_PARAM(IS_RTC_TAMPER_TIMESTAMPONTAMPER_DETECTION(sTamper->TimeStampOnTamperDetection));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Process Locked */
  __DAL_LOCK(hrtc);

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  hrtc->State = DAL_RTC_STATE_BUSY;

  /* Copy control register into temporary variable */
  tmpreg = hrtc->Instance->TACFG;

  /* Enable selected tamper */
  tmpreg |= (sTamper->Tamper);

  /* Configure the tamper trigger bit (this bit is just on the right of the
       tamper enable bit, hence the one-time right shift before updating it) */
  if (sTamper->Trigger == RTC_TAMPERTRIGGER_FALLINGEDGE)
  {
    /* Set the tamper trigger bit (case of falling edge or high level) */
    tmpreg |= (uint32_t)(sTamper->Tamper << 1U);
  }
  else
  {
    /* Clear the tamper trigger bit (case of rising edge or low level) */
    tmpreg &= (uint32_t)~(sTamper->Tamper << 1U);
  }

  /* Clear remaining fields before setting them */
  tmpreg &= ~(RTC_TAMPERFILTER_MASK              | \
              RTC_TAMPERSAMPLINGFREQ_RTCCLK_MASK | \
              RTC_TAMPERPRECHARGEDURATION_MASK   | \
              RTC_TAMPER_PULLUP_MASK             | \
              RTC_TACFG_TP1MSEL               | \
              RTC_TIMESTAMPONTAMPERDETECTION_MASK);

  /* Set remaining parameters of desired configuration into temporary variable */
  tmpreg |= ((uint32_t)sTamper->Filter            | \
             (uint32_t)sTamper->SamplingFrequency | \
             (uint32_t)sTamper->PrechargeDuration | \
             (uint32_t)sTamper->TamperPullUp      | \
             (uint32_t)sTamper->PinSelection      | \
             (uint32_t)sTamper->TimeStampOnTamperDetection);

  /* Disable tamper global interrupt in case it is enabled */
  tmpreg &= (uint32_t)~RTC_TACFG_TPIEN;

  /* Copy desired configuration into configuration register */
  hrtc->Instance->TACFG = tmpreg;

#else
  UNUSED(tmpreg);

  if (DAL_IS_BIT_SET(BAKPR->CLKCAL, (BAKPR_CLKCAL_CALCOEN | BAKPR_CLKCAL_ASPOEN)))
  {
    hrtc->State = DAL_RTC_STATE_ERROR;

    /* Process Unlocked */
    __DAL_UNLOCK(hrtc);

    return DAL_ERROR;
  }

  MODIFY_REG(BAKPR->CTRL, (BAKPR_CTRL_TPFCFG | BAKPR_CTRL_TPALCFG), (sTamper->Tamper | (sTamper->Trigger)));

#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  hrtc->State = DAL_RTC_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(hrtc);

  return DAL_OK;
}

/**
  * @brief  Sets Tamper with interrupt.
  * @note   By calling this API the tamper global interrupt will be enabled.
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sTamper Pointer to RTC Tamper.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTCEx_SetTamper_IT(RTC_HandleTypeDef *hrtc, RTC_TamperTypeDef *sTamper)
{
  uint32_t tmpreg = 0U;

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_TAMPER(sTamper->Tamper));
  ASSERT_PARAM(IS_RTC_TAMPER_TRIGGER(sTamper->Trigger));

