betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rtc_ex.c
  /* Get the status of the Interrupt */
  while (__DAL_RTC_TAMPER_GET_FLAG(hrtc, RTC_FLAG_TAMP1F) == 0U)
  {
    if (Timeout != DAL_MAX_DELAY)
    {
      if ((Timeout == 0U) || ((DAL_GetTick() - tickstart) > Timeout))
      {
        hrtc->State = DAL_RTC_STATE_TIMEOUT;
        return DAL_TIMEOUT;
      }
    }
  }

  /* Clear the Tamper Flag */
  __DAL_RTC_TAMPER_CLEAR_FLAG(hrtc, RTC_FLAG_TAMP1F);

  /* Change RTC state */
  hrtc->State = DAL_RTC_STATE_READY;

  return DAL_OK;
}

#if defined(RTC_TAMPER2_SUPPORT)
/**
  * @brief  Handles Tamper 2 Polling.
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  Timeout Timeout duration
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTCEx_PollForTamper2Event(RTC_HandleTypeDef *hrtc, uint32_t Timeout)
{
  uint32_t tickstart = 0U;

  /* Get tick */
  tickstart = DAL_GetTick();

  /* Get the status of the Interrupt */
  while (__DAL_RTC_TAMPER_GET_FLAG(hrtc, RTC_FLAG_TAMP2F) == 0U)
  {
    if (Timeout != DAL_MAX_DELAY)
    {
      if ((Timeout == 0U) || ((DAL_GetTick() - tickstart) > Timeout))
      {
        hrtc->State = DAL_RTC_STATE_TIMEOUT;
        return DAL_TIMEOUT;
      }
    }
  }

  /* Clear the Tamper Flag */
  __DAL_RTC_TAMPER_CLEAR_FLAG(hrtc, RTC_FLAG_TAMP2F);

  /* Change RTC state */
  hrtc->State = DAL_RTC_STATE_READY;

  return DAL_OK;
}
#endif /* RTC_TAMPER2_SUPPORT */

#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup RTCEx_Exported_Functions_Group2 RTC Wakeup functions
  * @brief    RTC Wakeup functions
  *
@verbatim
 ===============================================================================
                        ##### RTC Wakeup functions #####
 ===============================================================================

 [..] This section provides functions allowing to configure Wakeup feature

@endverbatim
  * @{
  */

/**
  * @brief  Sets wakeup timer.
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  WakeUpCounter Wakeup counter
  * @param  WakeUpClock Wakeup clock
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTCEx_SetWakeUpTimer(RTC_HandleTypeDef *hrtc, uint32_t WakeUpCounter, uint32_t WakeUpClock)
{
  uint32_t tickstart = 0U;

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_WAKEUP_CLOCK(WakeUpClock));
  ASSERT_PARAM(IS_RTC_WAKEUP_COUNTER(WakeUpCounter));

  /* Process Locked */
  __DAL_LOCK(hrtc);

  hrtc->State = DAL_RTC_STATE_BUSY;

  /* Disable the write protection for RTC registers */
  __DAL_RTC_WRITEPROTECTION_DISABLE(hrtc);

  /* Check RTC WUTWF flag is reset only when wakeup timer enabled*/
  if ((hrtc->Instance->CTRL & RTC_CTRL_WUTEN) != 0U)
  {
    tickstart = DAL_GetTick();

    /* Wait till RTC WUTWF flag is reset and if timeout is reached exit */
    while (__DAL_RTC_WAKEUPTIMER_GET_FLAG(hrtc, RTC_FLAG_WUTWF) != 0U)
    {
      if ((DAL_GetTick() - tickstart) > RTC_TIMEOUT_VALUE)
      {
        /* Enable the write protection for RTC registers */
        __DAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

        hrtc->State = DAL_RTC_STATE_TIMEOUT;

        /* Process Unlocked */
        __DAL_UNLOCK(hrtc);

        return DAL_TIMEOUT;
      }
    }
  }

  /* Disable the Wakeup timer */
  __DAL_RTC_WAKEUPTIMER_DISABLE(hrtc);

  /* Clear the Wakeup flag */
  __DAL_RTC_WAKEUPTIMER_CLEAR_FLAG(hrtc, RTC_FLAG_WUTF);

  /* Get tick */
  tickstart = DAL_GetTick();

  /* Wait till RTC WUTWF flag is set and if timeout is reached exit */
  while (__DAL_RTC_WAKEUPTIMER_GET_FLAG(hrtc, RTC_FLAG_WUTWF) == 0U)
  {
    if ((DAL_GetTick() - tickstart) > RTC_TIMEOUT_VALUE)
    {
      /* Enable the write protection for RTC registers */
      __DAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

      hrtc->State = DAL_RTC_STATE_TIMEOUT;

      /* Process Unlocked */
      __DAL_UNLOCK(hrtc);

      return DAL_TIMEOUT;
    }
  }

  /* Clear the Wakeup Timer clock source bits in CTRL register */
  hrtc->Instance->CTRL &= (uint32_t)~RTC_CTRL_WUCLKSEL;

  /* Configure the clock source */
  hrtc->Instance->CTRL |= (uint32_t)WakeUpClock;

  /* Configure the Wakeup Timer counter */
  hrtc->Instance->AUTORLD = (uint32_t)WakeUpCounter;

  /* Enable the Wakeup Timer */
  __DAL_RTC_WAKEUPTIMER_ENABLE(hrtc);

  /* Enable the write protection for RTC registers */
  __DAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

  hrtc->State = DAL_RTC_STATE_READY;

  /* Process Unlocked */
  __DAL_UNLOCK(hrtc);

  return DAL_OK;
}

/**
  * @brief  Sets wakeup timer with interrupt.
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  WakeUpCounter Wakeup counter
  * @param  WakeUpClock Wakeup clock
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTCEx_SetWakeUpTimer_IT(RTC_HandleTypeDef *hrtc, uint32_t WakeUpCounter, uint32_t WakeUpClock)
{
  __IO uint32_t count  = RTC_TIMEOUT_VALUE * (SystemCoreClock / 32U / 1000U);

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_WAKEUP_CLOCK(WakeUpClock));
  ASSERT_PARAM(IS_RTC_WAKEUP_COUNTER(WakeUpCounter));

  /* Process Locked */
  __DAL_LOCK(hrtc);

  hrtc->State = DAL_RTC_STATE_BUSY;

  /* Disable the write protection for RTC registers */
  __DAL_RTC_WRITEPROTECTION_DISABLE(hrtc);

  /* Check RTC WUTWF flag is reset only when wakeup timer enabled */
  if ((hrtc->Instance->CTRL & RTC_CTRL_WUTEN) != 0U)
  {
    /* Wait till RTC WUTWF flag is reset and if timeout is reached exit */
    do
    {
      if (count-- == 0U)
      {
        /* Enable the write protection for RTC registers */
        __DAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

        hrtc->State = DAL_RTC_STATE_TIMEOUT;

        /* Process Unlocked */
        __DAL_UNLOCK(hrtc);

        return DAL_TIMEOUT;
      }
    } while (__DAL_RTC_WAKEUPTIMER_GET_FLAG(hrtc, RTC_FLAG_WUTWF) != 0U);
  }

  /* Disable the Wakeup timer */
  __DAL_RTC_WAKEUPTIMER_DISABLE(hrtc);

